In [1]:
import pandas as pd 
import sqlite3

In [2]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in d:\anaconda\lib\site-packages (0.4.1)
Requirement already satisfied: six in d:\anaconda\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in d:\anaconda\lib\site-packages (from ipython-sql) (1.4.39)
Requirement already satisfied: ipython-genutils>=0.1.0 in d:\anaconda\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in d:\anaconda\lib\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: ipython>=1.0 in d:\anaconda\lib\site-packages (from ipython-sql) (7.31.1)
Requirement already satisfied: prettytable<1 in d:\anaconda\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in d:\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: traitlets>=4.2 in d:\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in d:\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: pygments in d:\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (2.11.2)
Requirement already satisfied: colorama in d:\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.5)
Requirement already satisfied: setuptools>=18.5 in d:\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (63.4.1)
Requirement already satisfied: decorator in d:\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: pickleshare in d:\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in d:\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in d:\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.6)
Requirement already satisfied: greenlet!=0.4.17 in d:\anaconda\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in d:\anaconda\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in d:\anaconda\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)

In [3]:
df=pd.DataFrame({'Name':['Mike', 'Queenie', 'Charles', 'Kevin'],
                 'Age':[30,42,18,15],
                 'City':['Kuala Lumpur', 'Bratislava', 'HonKong', 'Vienna']})

In [4]:
df.head()

      Name  Age          City
0     Mike   30  Kuala Lumpur
1  Queenie   42    Bratislava
2  Charles   18       HonKong
3    Kevin   15        Vienna

In [5]:
#connect sql to database 
cnn = sqlite3.connect('sql_jupiter_basic.db')

In [20]:
df.to_sql('people1',cnn)   #name of the table that we creating, cnn is a variable that I use to create connection

4

In [10]:
%reload_ext sql   #for magix sql to work

In [24]:
%sql sqlite:///sql_jupiter_basic.db

In [25]:
%%sql
SELECT *
FROM people1

   sqlite:///jupyter_sql_tutorial.db
 * sqlite:///sql_jupiter_basic.db
Done.

[(0, 'Mike', 30, 'Kuala Lumpur'),
 (1, 'Queenie', 42, 'Bratislava'),
 (2, 'Charles', 18, 'HonKong'),
 (3, 'Kevin', 15, 'Vienna')]

In [26]:
%%sql
SELECT count(*)
FROM people1

   sqlite:///jupyter_sql_tutorial.db
 * sqlite:///sql_jupiter_basic.db
Done.

[(4,)]

In [27]:
%%sql
SELECT sum(age) as 'age_sum'
FROM people1

   sqlite:///jupyter_sql_tutorial.db
 * sqlite:///sql_jupiter_basic.db
Done.

[(105,)]